Revit 2016 API
Grid.ExtendToAllLevels Method
 Adjusts the grid to cut all levels.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This method will be obsolete from 2016. Use Maximize3DExtents() instead.")]
public void ExtendToAllLevels()
Visual Basic
<ObsoleteAttribute("This method will be obsolete from 2016. Use Maximize3DExtents() instead.")> _
Public Sub ExtendToAllLevels
Visual C++
[ObsoleteAttribute(L"This method will be obsolete from 2016. Use Maximize3DExtents() instead.")]
public:
void ExtendToAllLevels()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  There is no plan view in the document.
See Also
Grid Class
Autodesk.Revit.DB Namespace